In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
dataset = pd.read_csv('../data/raw/online_retail_II.csv')

In [3]:
dataset.head()

,Invoice,StockCode,Description,Quantity,InvoiceDate,Price,Customer ID,Country
0,489434,85048,15CM CHRISTMAS GLASS BALL 20 LIGHTS,12,2009-12-01 07:45:00,6.95,13085.0,United Kingdom
1,489434,79323P,PINK CHERRY LIGHTS,12,2009-12-01 07:45:00,6.75,13085.0,United Kingdom
2,489434,79323W,WHITE CHERRY LIGHTS,12,2009-12-01 07:45:00,6.75,13085.0,United Kingdom
3,489434,22041,"RECORD FRAME 7"" SINGLE SIZE",48,2009-12-01 07:45:00,2.10,13085.0,United Kingdom
4,489434,21232,STRAWBERRY CERAMIC TRINKET BOX,24,2009-12-01 07:45:00,1.25,13085.0,United Kingdom

In [4]:
dataset.columns

Index(['Invoice', 'StockCode', 'Description', 'Quantity', 'InvoiceDate',
       'Price', 'Customer ID', 'Country'],
      dtype='object')

In [5]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1067371 entries, 0 to 1067370
Data columns (total 8 columns):
 #   Column       Non-Null Count    Dtype
---  ------       --------------    -----
 0   Invoice      1067371 non-null  object
 1   StockCode    1067371 non-null  object
 2   Description  1062989 non-null  object
 3   Quantity     1067371 non-null  int64
 4   InvoiceDate  1067371 non-null  object
 5   Price        1067371 non-null  float64
 6   Customer ID  824364 non-null   float64
 7   Country      1067371 non-null  object
dtypes: float64(2), int64(1), object(5)
memory usage: 65.1+ MB

In [6]:
dataset[dataset.Description.isna()]

,Invoice,StockCode,Description,Quantity,InvoiceDate,Price,Customer ID,Country
470,489521,21646,NaN,-50,2009-12-01 11:44:00,0.0,NaN,United Kingdom
3114,489655,20683,NaN,-44,2009-12-01 17:26:00,0.0,NaN,United Kingdom
3161,489659,21350,NaN,230,2009-12-01 17:39:00,0.0,NaN,United Kingdom
3731,489781,84292,NaN,17,2009-12-02 11:45:00,0.0,NaN,United Kingdom
4296,489806,18010,NaN,-770,2009-12-02 12:42:00,0.0,NaN,United Kingdom
...,...,...,...,...,...,...,...,...
1060783,581199,84581,NaN,-2,2011-12-07 18:26:00,0.0,NaN,United Kingdom
1060787,581203,23406,NaN,15,2011-12-07 18:31:00,0.0,NaN,United Kingdom
1060793,581209,21620,NaN,6,2011-12-07 18:35:00,0.0,NaN,United Kingdom
1062442,581234,72817,NaN,27,2011-12-08 10:33:00,0.0,NaN,United Kingdom
1064015,581408,85175,NaN,20,2011-12-08 14:06:00,0.0,NaN,United Kingdom

In [7]:
new_dataset = dataset.copy()

In [8]:
new_dataset.columns

Index(['Invoice', 'StockCode', 'Description', 'Quantity', 'InvoiceDate',
       'Price', 'Customer ID', 'Country'],
      dtype='object')

In [9]:
new_dataset.drop(columns=['Description' , 'Customer ID' , 'StockCode'] , inplace= True)
new_dataset.columns

Index(['Invoice', 'Quantity', 'InvoiceDate', 'Price', 'Country'], dtype='object')

In [10]:
new_dataset.isna().sum()

Invoice        0
Quantity       0
InvoiceDate    0
Price          0
Country        0
dtype: int64

In [11]:
new_dataset['TotalAmount'] = new_dataset['Quantity'] * new_dataset['Price']

In [12]:
new_dataset

,Invoice,Quantity,InvoiceDate,Price,Country,TotalAmount
0,489434,12,2009-12-01 07:45:00,6.95,United Kingdom,83.40
1,489434,12,2009-12-01 07:45:00,6.75,United Kingdom,81.00
2,489434,12,2009-12-01 07:45:00,6.75,United Kingdom,81.00
3,489434,48,2009-12-01 07:45:00,2.10,United Kingdom,100.80
4,489434,24,2009-12-01 07:45:00,1.25,United Kingdom,30.00
...,...,...,...,...,...,...
1067366,581587,6,2011-12-09 12:50:00,2.10,France,12.60
1067367,581587,4,2011-12-09 12:50:00,4.15,France,16.60
1067368,581587,4,2011-12-09 12:50:00,4.15,France,16.60
1067369,581587,3,2011-12-09 12:50:00,4.95,France,14.85
1067370,581587,1,2011-12-09 12:50:00,18.00,France,18.00

In [13]:
quantile = new_dataset['TotalAmount'].quantile(0.95)
quantile

np.float64(59.5)

In [14]:
new_dataset

,Invoice,Quantity,InvoiceDate,Price,Country,TotalAmount
0,489434,12,2009-12-01 07:45:00,6.95,United Kingdom,83.40
1,489434,12,2009-12-01 07:45:00,6.75,United Kingdom,81.00
2,489434,12,2009-12-01 07:45:00,6.75,United Kingdom,81.00
3,489434,48,2009-12-01 07:45:00,2.10,United Kingdom,100.80
4,489434,24,2009-12-01 07:45:00,1.25,United Kingdom,30.00
...,...,...,...,...,...,...
1067366,581587,6,2011-12-09 12:50:00,2.10,France,12.60
1067367,581587,4,2011-12-09 12:50:00,4.15,France,16.60
1067368,581587,4,2011-12-09 12:50:00,4.15,France,16.60
1067369,581587,3,2011-12-09 12:50:00,4.95,France,14.85
1067370,581587,1,2011-12-09 12:50:00,18.00,France,18.00

In [15]:
dates = new_dataset.InvoiceDate
dates

0          2009-12-01 07:45:00
1          2009-12-01 07:45:00
2          2009-12-01 07:45:00
3          2009-12-01 07:45:00
4          2009-12-01 07:45:00
                  ...
1067366    2011-12-09 12:50:00
1067367    2011-12-09 12:50:00
1067368    2011-12-09 12:50:00
1067369    2011-12-09 12:50:00
1067370    2011-12-09 12:50:00
Name: InvoiceDate, Length: 1067371, dtype: object

In [16]:
def get_date(df, column_name):
    df[column_name] = pd.to_datetime(df[column_name])
    
    df['Year']  = df[column_name].dt.year
    df['Month'] = df[column_name].dt.month
    df['Day']   = df[column_name].dt.day
    df['Hour']  = df[column_name].dt.hour
    df['min'] = df[column_name].dt.minute
    df['sec'] = df[column_name].dt.second
    
    return df

In [17]:
new_dataset = get_date(new_dataset, 'InvoiceDate')

In [18]:
print(new_dataset[['InvoiceDate', 'Year', 'Month', 'Day', 'Hour' , 'min' , 'sec']].head())

          InvoiceDate  Year  Month  Day  Hour  min  sec
0 2009-12-01 07:45:00  2009     12    1     7   45    0
1 2009-12-01 07:45:00  2009     12    1     7   45    0
2 2009-12-01 07:45:00  2009     12    1     7   45    0
3 2009-12-01 07:45:00  2009     12    1     7   45    0
4 2009-12-01 07:45:00  2009     12    1     7   45    0

In [19]:
new_dataset.columns

Index(['Invoice', 'Quantity', 'InvoiceDate', 'Price', 'Country', 'TotalAmount',
       'Year', 'Month', 'Day', 'Hour', 'min', 'sec'],
      dtype='object')

In [20]:
new_dataset.drop(columns=['Invoice'] , inplace= True)

In [22]:
new_dataset.columns

Index(['Quantity', 'InvoiceDate', 'Price', 'Country', 'TotalAmount', 'Year',
       'Month', 'Day', 'Hour', 'min', 'sec'],
      dtype='object')

In [91]:
new_dataset.Country.unique()

array(['United Kingdom', 'France', 'USA', 'Belgium', 'Australia', 'EIRE',
       'Germany', 'Portugal', 'Japan', 'Denmark', 'Nigeria',
       'Netherlands', 'Poland', 'Spain', 'Channel Islands', 'Italy',
       'Cyprus', 'Greece', 'Norway', 'Austria', 'Sweden',
       'United Arab Emirates', 'Finland', 'Switzerland', 'Unspecified',
       'Malta', 'Bahrain', 'RSA', 'Bermuda', 'Hong Kong', 'Singapore',
       'Thailand', 'Israel', 'Lithuania', 'West Indies', 'Lebanon',
       'Korea', 'Brazil', 'Canada', 'Iceland', 'Saudi Arabia',
       'Czech Republic', 'European Community'], dtype=object)

In [92]:
from sklearn.preprocessing import LabelEncoder

In [93]:
le = LabelEncoder()

In [94]:
new_dataset['Country'] = le.fit_transform(new_dataset['Country'])

In [95]:
new_dataset

,Invoice,Quantity,Price,Country,TotalAmount,Year,Month,Day,Hour,min,sec
0,489434,12,6.95,40,83.40,2009,12,1,7,45,0
1,489434,12,6.75,40,81.00,2009,12,1,7,45,0
2,489434,12,6.75,40,81.00,2009,12,1,7,45,0
3,489434,48,2.10,40,100.80,2009,12,1,7,45,0
4,489434,24,1.25,40,30.00,2009,12,1,7,45,0
...,...,...,...,...,...,...,...,...,...,...,...
1067366,581587,6,2.10,14,12.60,2011,12,9,12,50,0
1067367,581587,4,4.15,14,16.60,2011,12,9,12,50,0
1067368,581587,4,4.15,14,16.60,2011,12,9,12,50,0
1067369,581587,3,4.95,14,14.85,2011,12,9,12,50,0
1067370,581587,1,18.00,14,18.00,2011,12,9,12,50,0

In [96]:
new_dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1067371 entries, 0 to 1067370
Data columns (total 11 columns):
 #   Column       Non-Null Count    Dtype
---  ------       --------------    -----
 0   Invoice      1067371 non-null  object
 1   Quantity     1067371 non-null  int64
 2   Price        1067371 non-null  float64
 3   Country      1067371 non-null  int64
 4   TotalAmount  1067371 non-null  float64
 5   Year         1067371 non-null  int32
 6   Month        1067371 non-null  int32
 7   Day          1067371 non-null  int32
 8   Hour         1067371 non-null  int32
 9   min          1067371 non-null  int32
 10  sec          1067371 non-null  int32
dtypes: float64(2), int32(6), int64(2), object(1)
memory usage: 65.1+ MB

In [97]:
new_dataset['value'] = np.where(new_dataset['TotalAmount'] > quantile, 1, 0)

In [98]:
new_dataset.drop(columns=['Invoice' , 'TotalAmount'] , inplace= True)

In [99]:
new_dataset

         Quantity  Price  Country  Year  Month  Day  Hour  min  sec  value
0              12   6.95       40  2009     12    1     7   45    0      1
1              12   6.75       40  2009     12    1     7   45    0      1
2              12   6.75       40  2009     12    1     7   45    0      1
3              48   2.10       40  2009     12    1     7   45    0      1
4              24   1.25       40  2009     12    1     7   45    0      0
...           ...    ...      ...   ...    ...  ...   ...  ...  ...    ...
1067366         6   2.10       14  2011     12    9    12   50    0      0
1067367         4   4.15       14  2011     12    9    12   50    0      0
1067368         4   4.15       14  2011     12    9    12   50    0      0
1067369         3   4.95       14  2011     12    9    12   50    0      0
1067370         1  18.00       14  2011     12    9    12   50    0      0

[1067371 rows x 10 columns]

In [101]:
new_dataset.to_csv('../data/processed/data.csv', index=False)